EDT/УТ/src/Documents/ДанныеЗаказаСамовывоза/ДанныеЗаказаСамовывоза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеЗаказаСамовывоза</name>
  <registerRecords>AccumulationRegister.ДанныеЧастичныхЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентамиПоЗаказам</registerRecords>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <registerRecords>InformationRegister.СостоянияЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентами</registerRecords>
  <registerRecords>AccumulationRegister.УчетДенежныхСредствКассиромРасширеный</registerRecords>
  <registerRecords>AccumulationRegister.УчетДенежныхСредствКассиром</registerRecords>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеВыполненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратТоваровОтПокупателя</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПервоначально</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоставленныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/новаРезультатМестнойДоставки/новаРезультатМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаРезультатМестнойДоставки</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>ВыполненаЧастично</name>
      <description>Выполнена частично</description>
    </items>
    <items>
      <name>НеВыполнена</name>
      <description>Не выполнена</description>
    </items>
  </predefined>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.новаРезультатВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныНеВыполнения</name>
    <type>
      <types>CatalogRef.новаПричиныНеВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплатыВодителю</name>
    <comment>Если выполнена 100%</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПосещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ПричиныНеВыполненияДоставки/ПричиныНеВыполненияДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныНеВыполненияДоставки</name>
  <predefined>
    <items>
      <name>НеДоставлен</name>
      <description>Не доставлен</description>
    </items>
    <items>
      <name>НетНаСкладе</name>
      <description>Нет на складе</description>
    </items>
    <items>
      <name>ОтказКлиентаБезЗаезда</name>
      <description>Отказ клиента без заезда</description>
    </items>
    <items>
      <name>ОтказКлиентаСЗаездом</name>
      <description>Отказ клиента с заездом</description>
    </items>
    <items>
      <name>ПереносДоставки</name>
      <description>Перенос доставки</description>
    </items>
    <items>
      <name>ПереносНаВторуюОчередь</name>
      <description>Перенос на вторую очередь (без заезда)</description>
    </items>
    <items>
      <name>ПереносСЗаездом</name>
      <description>Перенос с заездом</description>
    </items>
  </predefined>
  <attributes>
    <name>Перенос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВМобильномПриложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заезд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАдминки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьВводПричиныОтказаПереноса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ПричиныОтказаПереноса/ПричиныОтказаПереноса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныОтказаПереноса</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Брак</name>
      <description>Брак</description>
    </items>
    <items>
      <name>КлиентаНетНаМесте</name>
      <description>Клиента нет на месте</description>
    </items>
    <items>
      <name>НеДозвонилисьДоКлиента</name>
      <description>Не дозвонились до клиента</description>
    </items>
    <items>
      <name>НеТотТовар</name>
      <description>Не тот товар</description>
    </items>
    <items>
      <name>НеУспелиПоВремени</name>
      <description>Не успели по времени</description>
    </items>
    <items>
      <name>ОтказКлиента</name>
      <description>Отказ клиента</description>
    </items>
    <items>
      <name>ПереносЗаказовВСвязиСПревышениемЛимита</name>
      <description>Перенос заказов в связи с превышением лимита</description>
    </items>
    <items>
      <name>ПоПисьмуМагазина</name>
      <description>По письму магазина</description>
    </items>
    <items>
      <name>ПоПросьбеКлиента</name>
      <description>По просьбе клиента</description>
    </items>
  </predefined>
  <attributes>
    <name>СторонаПретензии</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораЛогистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьВводНовогоАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьСменуИнтервала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВАдминке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораПриГрупповойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступностьПоПричинамНеВыполненияЗаказа</name>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Documents/ДанныеЗаказаСамовывоза/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ТолькоПросмотр = Истина;
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.ТерминалОбработки = ПараметрыСеанса.ТерминалДоставки; //Задача № 3045
	КонецеСли;	
КонецПроцедуры

Функция ЗаполнитьДокумент(УстановитьТерминалОбработки = Неопределено) Экспорт
	Если Объект.Реализация.Пустая() Тогда
		Возврат Ложь;
	КонецеСли;	
	
	
	Объект.ВозвратТоваровОтПокупателя = Документы.ВозвратТоваровОтПокупателя.НайтиПоНомеру(Объект.Реализация.Номер, Объект.Реализация.Дата);
	
	Для Каждого Тек Из Объект.Реализация.Товары Цикл
		Нов = Объект.ДоставленныеТовары.Добавить();
		Нов.Номенклатура = Тек.Номенклатура;
		Нов.КоличествоДоставлено = Тек.Количество;
		Нов.Количество = Тек.Количество;
		Нов.Цена = Тек.Цена;
		Нов.Сумма = Тек.Сумма;
		//Асеев 04.09.2020 (Задача № 4185)>>>
		Нов.КодМаркировки = Тек.КодМаркировки;
		//Асеев 04.09.2020 (Задача № 4185)<<<
	КонецЦикла;	
	
	Для Каждого Тек Из Объект.Реализация.ПодарочныеПозиции Цикл
		Нов = Объект.ДоставленныеТовары.Добавить();
		Нов.Номенклатура = Тек.Номенклатура;
		Нов.КоличествоДоставлено = Тек.Количество;
		Нов.Количество = Тек.Количество;
		Нов.Цена = Тек.Цена;
		Нов.Сумма = Тек.Сумма;
		//Асеев 04.09.2020 (Задача № 4185)>>>
		Нов.КодМаркировки = Тек.КодМаркировки;
		//Асеев 04.09.2020 (Задача № 4185)<<<
	КонецЦикла;	
	
	
	Если Не Объект.ВозвратТоваровОтПокупателя.Пустая() Тогда
		Для Каждого Тек Из Объект.ВозвратТоваровОтПокупателя.Товары Цикл
			Нов = Объект.ДоставленныеТовары.Добавить();
			Нов.Номенклатура = Тек.Номенклатура;
			Нов.КоличествоДоставлено = Тек.Количество;
			Нов.Количество = - Тек.Количество;
			Нов.Цена = Тек.Цена;
			Нов.Сумма = - Тек.Сумма;
			//Асеев 04.09.2020 (Задача № 4185)>>>
			Нов.КодМаркировки = Тек.КодМаркировки;
			//Асеев 04.09.2020 (Задача № 4185)<<<
		КонецЦикла;	
	КонецеСли;
	
	Если объект.ДоставленныеТовары.Количество() = 0 Тогда
		Возврат Ложь;
	КонецеСли;
	
	Объект.СтоимостьДоставки = Объект.Реализация.Услуги.Итог("Сумма");
	Объект.СтоимостьДоставкиПервоначально = Объект.Реализация.Услуги.Итог("Сумма");
	
	Объект.СуммаДокумента = Объект.ДоставленныеТовары.Итог("Сумма") + Объект.СтоимостьДоставки;
	
	Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.Выполнена;
	
	Если Не УстановитьТерминалОбработки = Неопределено Тогда // Задача № 3045
		Объект.ТерминалОбработки = УстановитьТерминалОбработки;
	КонецЕсли;

	//CeHbKA
	Объект.ЮрЛицо = Объект.Реализация.ВладелецТовара.ОсновнойДоговорКонтрагента.Организация;
	
	СтатусЗаказаПриИзмененииНаСервере();
	Возврат Истина;
КонецФункции


&НаКлиенте
Процедура ДоставленныеТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ДоставленныеТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ДоставленныеТоварыКоличествоДоставленоПриИзменении(Элемент)
	ДоставленныеТоварыКоличествоДоставленоПриИзмененииНаСервере(Элементы.ДоставленныеТовары.ТекущиеДанные);
	СтатусЗаказаПриИзмененииНаСервере();;
КонецПроцедуры


&НаКлиенте
Процедура ДоставленныеТоварыКоличествоДоставленоПриИзмененииНаСервере(Тек)
	Тек.Сумма = Тек.Цена * Тек.КоличествоДоставлено;
	Объект.СуммаДокумента = Объект.ДоставленныеТовары.Итог("Сумма") + Объект.СтоимостьДоставки;
	
	Если Объект.ДоставленныеТовары.Итог("Количество") <> Объект.ДоставленныеТовары.Итог("КоличествоДоставлено") Тогда
		Если Объект.ДоставленныеТовары.Итог("КоличествоДоставлено") = 0 Тогда
			Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.НеВыполнена;
		Иначе
			Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.ВыполненаЧастично;
		КонецеСли;
	Иначе	
		Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.Выполнена;
	КонецеСли;	
КонецПроцедуры


&НаКлиенте
Процедура СтатусЗаказаПриИзменении(Элемент)
	Если Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.Выполнена Тогда
		Объект.ПричинаНеВыполненияЗаказа = Справочники.ПричиныНеВыполненияДоставки.ПустаяСсылка();
		Объект.ПричинаОтказа = Справочники.ПричиныОтказаПереноса.ПустаяСсылка();
		Объект.ДатаПереноса = Дата("00010101");
		Элементы.ПричинаНеВыполненияЗаказа.Доступность = Ложь;
		Элементы.ПричинаОтказа.Доступность = Ложь;
		Элементы.ДатаПереноса.Доступность = Ложь;
		УстановитьКоличество(Ложь);
	Иначе
		Элементы.ПричинаНеВыполненияЗаказа.Доступность = Истина;
		Элементы.ПричинаОтказа.Доступность = Истина;		
		Элементы.ДатаПереноса.Доступность = Истина;
		Если Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.НеВыполнена Тогда
			УстановитьКоличество(Истина);
		КонецеСЛи;	
	КонецеСли;	
	СтатусЗаказаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусЗаказаПриИзмененииНаСервере()
	Если Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.Выполнена Тогда
		Объект.ПричинаНеВыполненияЗаказа = Справочники.ПричиныНеВыполненияДоставки.ПустаяСсылка();
		Объект.ПричинаОтказа = Справочники.ПричиныОтказаПереноса.ПустаяСсылка();
		Объект.ДатаПереноса = Дата("00010101");
		Элементы.ПричинаНеВыполненияЗаказа.Доступность = Ложь;
		Элементы.ПричинаОтказа.Доступность = Ложь;
		Элементы.ДатаПереноса.Доступность = Ложь;
		УстановитьКоличество(Ложь);
	Иначе
		Элементы.ПричинаНеВыполненияЗаказа.Доступность = Истина;
		Элементы.ПричинаОтказа.Доступность = Истина;		
		Элементы.ДатаПереноса.Доступность = Истина;
		Если Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.НеВыполнена Тогда
			УстановитьКоличество(Истина);
		КонецеСЛи;	
	КонецеСли;	
КонецПроцедуры


&НаСервере
Процедура УстановитьКоличество(Режим)
	Для Каждого Тек Из Объект.ДоставленныеТовары Цикл
		Если Режим Тогда
			Тек.КоличествоДоставлено = 0;
		Иначе
			Тек.КоличествоДоставлено = Тек.Количество;
		КонецеСли;
		Тек.Сумма = Тек.Цена * Тек.КоличествоДоставлено;
	КонецЦикла;	
	Объект.СуммаДокумента = Объект.ДоставленныеТовары.Итог("Сумма") + Объект.СтоимостьДоставки;	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если объект.ПричинаНеВыполненияЗаказа.Перенос Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаПереноса) Тогда
			Сообщить("Укажите дату переноса!");
			Отказ = Истина;
			Возврат;
		КонецеСли;	
	КонецеСли;
	
	Если Объект.СтатусЗаказа = Справочники.новаРезультатМестнойДоставки.НеВыполнена Тогда
		Если объект.ПричинаНеВыполненияЗаказа.Пустая() Тогда
			Сообщить("Укажите причину невыполнения заказа!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
		Если объект.ПричинаОтказа.Пустая() Тогда
			Сообщить("Укажите причину отказа/переноса заказа!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;		
	КонецеСли;	
КонецПроцедуры


&НаКлиенте
Процедура СтоимостьДоставкиПриИзменении(Элемент)
	СтоимостьДоставкиПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура СтоимостьДоставкиПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	Объект.СуммаДокумента = Объект.ДоставленныеТовары.Итог("Сумма") + Объект.СтоимостьДоставки;
КонецПроцедуры


&НаКлиенте
Процедура ПричинаНеВыполненияЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если РольДоступна("ОператорСамовывоза") Тогда
		Для Каждого Стр Из Элемент.СписокВыбора Цикл
			Если Стр.Значение = Справочники.ПричиныНеВыполненияДоставки.НеДоставлен Тогда
				Элемент.СписокВыбора.Удалить(Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьТаблицуЗаказыДляСамовывоза");
КонецПроцедуры


&НаКлиенте
Процедура ПричинаОтказаПриИзменении(Элемент)
	Если Объект.ПричинаОтказа.Пустая() Тогда
		Объект.ИнициаторСостояния = "";
	Иначе
		Объект.ИнициаторСостояния = Объект.ПричинаОтказа.ИнициаторСостояния;
	КонецеСли;	
КонецПроцедуры
